2015-12-30-generic-functions-and-multimethods-versus-visitors-and-factories.org
#+SETUPFILE: setup.org
#+TITLE: Generic functions and multimethods versus visitors and factories
#+DATE: 2015-12-30
#+HTML_LINK_UP: https://Harleqin.github.io/

In the article “Synthesizing Object-Oriented and Functional Design to Promote
Reuse” by Shriram Krishnamurthi et al. from 2003
(http://www.cs.rice.edu/~cork/teachjava/2003/readings/visitor1.pdf) the authors
propose a design pattern combining visitors with factory methods.

I propose here that the problem they present is better solved through generic
functions and multimethods.

* Summary

The concrete problem presented is one of those rather academic problems: a
little class hierarchy based on shapes, and a few operations on them, the
question being how to organize the code in such a way that extending it with a
new class or with a new operation can be done without modification of existing
code.

The unspoken basic problem is to get (run-time) dispatch to the right method
implementation for a given object, when (in “classical object-oriented”
parlance) you cannot put the method into the object's class directly.

The “classical object-oriented” solution proposed in the paper is roughly to use
a visitor for selection of the right method and a factory method for selection
of the right visitor.

The solution I propose is to use generic functions and multimethods.  Generic
functions and the methods defined on them can be written independently from the
classes of the objects on which they operate.  They also do (run-time) dispatch
on their arguments (in contrast to compile-time overloading).  The effect is
that you “just call” the generic function on whatever objects occur at run-time,
and the right method will be selected each time.  You can also write new methods
for both generic functions and classes that are defined elsewhere, including the
language standard.

In the following, I'll write this out in code, first Java, then Common Lisp.

