2015-12-30-generic-functions-and-multimethods-versus-visitors-and-factories.html
<!DOCTYPE html>
<html>
<head>
<title>Generic functions and multimethods versus visitors and factories</title>
<!-- 2015-12-30 Mi 23:31 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Svante">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://Harleqin.github.io/"> UP </a>
 |
 <a accesskey="H" href="https://Harleqin.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">Generic functions and multimethods versus visitors and factories</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Summary</a></li>
<li><a href="#sec-2">2. Java</a></li>
<li><a href="#sec-3">3. Common Lisp</a></li>
<li><a href="#sec-4">4. Your thoughts</a></li>
<li><a href="#sec-5">5. Comparison</a></li>
<li><a href="#sec-6">6. Conclusion</a></li>
</ul>
</div>
</div>
<p>
In the article “Synthesizing Object-Oriented and Functional Design to Promote
Reuse” by Shriram Krishnamurthi et al. from 2003
(<a href="http://www.cs.rice.edu/~cork/teachjava/2003/readings/visitor1.pdf">http://www.cs.rice.edu/~cork/teachjava/2003/readings/visitor1.pdf</a>) the authors
propose a design pattern combining visitors with factory methods.
</p>

<p>
I propose here that the problem they present is better solved through generic
functions and multimethods.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Summary</h2>
<div class="outline-text-2" id="text-1">
<p>
The concrete problem presented is one of those rather academic problems: a
little class hierarchy based on shapes, and a few operations on them, the
question being how to organize the code in such a way that extending it with a
new class or with a new operation can be done without modification of existing
code.
</p>

<p>
The unspoken basic problem is to get (run-time) dispatch to the right method
implementation for a given object, when (in “classical object-oriented”
parlance) you cannot put the method into the object's class directly.
</p>

<p>
The “classical object-oriented” solution proposed in the paper is roughly to use
a visitor for selection of the right method and a factory method for selection
of the right visitor.
</p>

<p>
The solution I propose is to use generic functions and multimethods.  Generic
functions and the methods defined on them can be written independently from the
classes of the objects on which they operate.  They also do (run-time) dispatch
on their arguments (in contrast to compile-time overloading).  The effect is
that you “just call” the generic function on whatever objects occur at run-time,
and the right method will be selected each time.  You can also write new methods
for both generic functions and classes that are defined elsewhere, including the
language standard.
</p>

<p>
In the following, I'll write this out in code, first Java, then Common Lisp.
</p>
</div>
</div>
