2015-12-30-generic-functions-and-multimethods-versus-visitors-and-factories.org
* Java

I use Java for the “classical” part, because it is the language from this family
I am most familiar with.  In contrast to the article, I can use a more modern
Java version that has “generics” (parametric polymorphism, has nothing to do
with generic functions).

First up, a little class hierarchy.  I use very basic language (no ~final~
declarations, no nullness annotations, and direct field access for ~Point~), so
that it stays somewhat readable on this page.

#+BEGIN_SRC java
  package shape;

  /**
   * A basic shape class.  Shapes are centered at the origin by default.
   */
  abstract class Shape {
      <T> T accept (ShapeVisitor<T> visitor);
  }
#+END_SRC

#+BEGIN_SRC java
  package shape;

  class Square extends Shape {
      private double width;

      Shape (double width) {
          this.width = width;
      }

      <T> T accept (ShapeVisitor<T> visitor) {
          return visitor.visit( this );
      }

      double getWidth () {
          return this.width;
      }
  }
#+END_SRC

#+BEGIN_SRC java
  package shape;

  class Circle extends Shape {
      private double radius;

      Circle (double radius) {
          this.radius = radius;
      }

      <T> T accept (ShapeVisitor<T> visitor) {
          return visitor.visit( this );
      }

      double getRadius () {
          return this.radius;
      }
  }
#+END_SRC

#+BEGIN_SRC java
  package shape;

  /**
   * This represents a translated shape.
   */
  class Translated extends Shape {
      private Shape shape;
      private Point translation;

      Translated (Shape shape, Point translation) {
          this.shape = shape;
          this.translation = translation;
      }

      <T> T accept (ShapeVisitor<T> visitor) {
          return visitor.visit( this );
      }

      Shape getShape () {
          return this.shape;
      }

      Point getTranslation () {
          return this.translation;
      }
  }
#+END_SRC

This is a little helper:

#+BEGIN_SRC java
  package shape;

  /**
   * A two-dimensional vector.
   */
  class Point {
      double x;
      double y;

      Point (double x, double y) {
          this.x = x;
          this.y = y;
      }
  }
#+END_SRC

We start out with one operation:

#+BEGIN_SRC java
  package shape;

  /**
   * Interface for operations on shapes.  Implementations should have private
   * constructors and factory methods, so that extensions to existing visitors can
   * still be applied recursively.
   */
  interface ShapeVisitor<T> {
      T visit (Square square);
      T visit (Circle circle);
      T visit (Translated translated);
  }
#+END_SRC

#+BEGIN_SRC java
  package shape;

  class PointIn implements ShapeVisitor<Boolean> {
      protected Point point;

      private PointIn (Point point) {
          this.point = point;
      }

      PointIn makePointIn (Point point) {
          return new PointIn( point );
      }

      Boolean visit (Square square) {
          return point.x > -(square.getWidth / 2)
              && point.x < (square.getWidth / 2)
              && point.y > -(square.getWidth / 2)
              && point.y < (square.getWidth / 2);
      }

      Boolean visit (Circle circle) {
          return Math.sqrt( point.x ^ 2 + point.y ^ 2 ) < circle.getRadius();
      }

      Boolean visit (Translated translated) {
          Point translation = translated.getTranslation();
          Point untranslatedPoint = new Point( this.point.x - translation.x,
                                               this.point.y - translation.y );
          return translated.getShape().accept( makePointIn( untranslatedPoint ) );
      }
  }
#+END_SRC

Now we add another operation:

#+BEGIN_SRC java
  package shape;

  class Shrink implements ShapeVisitor<Shape> {

      protected double factor;

      private Shrink (double factor) {
          this.factor = factor;
      }

      Shrink makeShrink (double factor) {
          if (factor == 0) {
              throw new IllegalArgumentException();
          }
          return new Shrink<Shape>(factor);
      }

      Shape visit (Square square) {
          return new Square( square.getWidth() / factor );
      }

      Shape visit (Circle circle) {
          return new Circle( circle.getRadius() / factor );
      }

      Shape visit (Translated translated) {
          return new Translated( translated.getShape().accept( makeShrink( factor ) ),
                                 translated.getTranslation() );
      }
  }
#+END_SRC

Finally, we add another class:

#+BEGIN_SRC java
  package shape;

  class Union extends Shape {
      private Shape s0;
      private Shape s1;

      public Union (Shape s0, Shape s1) {
          this.s0 = s0;
          this.s1 = s1;
      }

      <T> accept (ShapeVisitor<T> visitor) {
          // might throw a ClassCastException if improperly used
          return ((UnionShapeVisitor) visitor).visit( this );
      }

      Shape getShape0 () {
          return this.s0;
      }

      Shape getShape1 () {
          return this.s1;
      }
  }
#+END_SRC

This needs extended visitors:

#+BEGIN_SRC java
  package shape;

  interface UnionShapeVisitor<T> extends ShapeVisitor<T> {
      T visit (Union union);
  }
#+END_SRC

#+BEGIN_SRC java
  package shape;

  class PointInUnion extends PointIn implements UnionShapeVisitor<Boolean> {

      private PointInUnion (Point point) {
          this.point = point;
      }

      PointIn makePointIn (Point point) {
          return new PointInUnion( point );
      }

      Boolean visit (Union union) {
          return union.getShape0().accept( makePointIn( this.point ) )
              || union.getShape1().accept( makePointIn( this.point ) );
      }
  }
#+END_SRC

#+BEGIN_SRC java
  package shape;

  class ShrinkUnion extends Shrink implements UnionShapeVisitor<Shape> {

      private ShrinkUnion (double factor) {
          this.factor = factor;
      }

      Shrink makeShrink (double factor) {
          return new ShrinkUnion( factor );
      }

      Shape visit (Union union) {
          return new Union( union.getShape0().accept( makeShrink( this.factor ) ),
                            union.getShape1().accept( makeShrink( this.factor ) ) );
      }
  }
#+END_SRC

