2015-12-30-generic-functions-and-multimethods-versus-visitors-and-factories.html

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Java</h2>
<div class="outline-text-2" id="text-2">
<p>
I use Java for the “classical” part, because it is the language from this family
I am most familiar with.  In contrast to the article, I can use a more modern
Java version that has “generics” (parametric polymorphism, has nothing to do
with generic functions).
</p>

<p>
First up, a little class hierarchy.  I use very basic language (no <code>final</code>
declarations, no nullness annotations, and direct field access for <code>Point</code>), so
that it stays somewhat readable on this page.
</p>

<div class="org-src-container">

<pre class="src src-java">package shape;

/**
 * A basic shape class.  Shapes are centered at the origin by default.
 */
abstract class Shape {
    &lt;T&gt; T accept (ShapeVisitor&lt;T&gt; visitor);
}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-java">package shape;

class Square extends Shape {
    private double width;

    Shape (double width) {
        this.width = width;
    }

    &lt;T&gt; T accept (ShapeVisitor&lt;T&gt; visitor) {
        return visitor.visit( this );
    }

    double getWidth () {
        return this.width;
    }
}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-java">package shape;

class Circle extends Shape {
    private double radius;

    Circle (double radius) {
        this.radius = radius;
    }

    &lt;T&gt; T accept (ShapeVisitor&lt;T&gt; visitor) {
        return visitor.visit( this );
    }

    double getRadius () {
        return this.radius;
    }
}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-java">package shape;

/**
 * This represents a translated shape.
 */
class Translated extends Shape {
    private Shape shape;
    private Point translation;

    Translated (Shape shape, Point translation) {
        this.shape = shape;
        this.translation = translation;
    }

    &lt;T&gt; T accept (ShapeVisitor&lt;T&gt; visitor) {
        return visitor.visit( this );
    }

    Shape getShape () {
        return this.shape;
    }

    Point getTranslation () {
        return this.translation;
    }
}
</pre>
</div>

<p>
This is a little helper:
</p>

<div class="org-src-container">

<pre class="src src-java">package shape;

/**
 * A two-dimensional vector.
 */
class Point {
    double x;
    double y;

    Point (double x, double y) {
        this.x = x;
        this.y = y;
    }
}
</pre>
</div>

<p>
We start out with one operation:
</p>

<div class="org-src-container">

<pre class="src src-java">package shape;

/**
 * Interface for operations on shapes.  Implementations should have private
 * constructors and factory methods, so that extensions to existing visitors can
 * still be applied recursively.
 */
interface ShapeVisitor&lt;T&gt; {
    T visit (Square square);
    T visit (Circle circle);
    T visit (Translated translated);
}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-java">package shape;

class PointIn implements ShapeVisitor&lt;Boolean&gt; {
    protected Point point;

    private PointIn (Point point) {
        this.point = point;
    }

    PointIn makePointIn (Point point) {
        return new PointIn( point );
    }

    Boolean visit (Square square) {
        return point.x &gt; -(square.getWidth / 2)
            &amp;&amp; point.x &lt; (square.getWidth / 2)
            &amp;&amp; point.y &gt; -(square.getWidth / 2)
            &amp;&amp; point.y &lt; (square.getWidth / 2);
    }

    Boolean visit (Circle circle) {
        return Math.sqrt( point.x ^ 2 + point.y ^ 2 ) &lt; circle.getRadius();
    }

    Boolean visit (Translated translated) {
        Point translation = translated.getTranslation();
        Point untranslatedPoint = new Point( this.point.x - translation.x,
                                             this.point.y - translation.y );
        return translated.getShape().accept( makePointIn( untranslatedPoint ) );
    }
}
</pre>
</div>

<p>
Now we add another operation:
</p>

<div class="org-src-container">

<pre class="src src-java">package shape;

class Shrink implements ShapeVisitor&lt;Shape&gt; {

    protected double factor;

    private Shrink (double factor) {
        this.factor = factor;
    }

    Shrink makeShrink (double factor) {
        if (factor == 0) {
            throw new IllegalArgumentException();
        }
        return new Shrink&lt;Shape&gt;(factor);
    }

    Shape visit (Square square) {
        return new Square( square.getWidth() / factor );
    }

    Shape visit (Circle circle) {
        return new Circle( circle.getRadius() / factor );
    }

    Shape visit (Translated translated) {
        return new Translated( translated.getShape().accept( makeShrink( factor ) ),
                               translated.getTranslation() );
    }
}
</pre>
</div>

<p>
Finally, we add another class:
</p>

<div class="org-src-container">

<pre class="src src-java">package shape;

class Union extends Shape {
    private Shape s0;
    private Shape s1;

    public Union (Shape s0, Shape s1) {
        this.s0 = s0;
        this.s1 = s1;
    }

    &lt;T&gt; accept (ShapeVisitor&lt;T&gt; visitor) {
        // might throw a ClassCastException if improperly used
        return ((UnionShapeVisitor) visitor).visit( this );
    }

    Shape getShape0 () {
        return this.s0;
    }

    Shape getShape1 () {
        return this.s1;
    }
}
</pre>
</div>

<p>
This needs extended visitors:
</p>

<div class="org-src-container">

<pre class="src src-java">package shape;

interface UnionShapeVisitor&lt;T&gt; extends ShapeVisitor&lt;T&gt; {
    T visit (Union union);
}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-java">package shape;

class PointInUnion extends PointIn implements UnionShapeVisitor&lt;Boolean&gt; {

    private PointInUnion (Point point) {
        this.point = point;
    }

    PointIn makePointIn (Point point) {
        return new PointInUnion( point );
    }

    Boolean visit (Union union) {
        return union.getShape0().accept( makePointIn( this.point ) )
            || union.getShape1().accept( makePointIn( this.point ) );
    }
}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-java">package shape;

class ShrinkUnion extends Shrink implements UnionShapeVisitor&lt;Shape&gt; {

    private ShrinkUnion (double factor) {
        this.factor = factor;
    }

    Shrink makeShrink (double factor) {
        return new ShrinkUnion( factor );
    }

    Shape visit (Union union) {
        return new Union( union.getShape0().accept( makeShrink( this.factor ) ),
                          union.getShape1().accept( makeShrink( this.factor ) ) );
    }
}
</pre>
</div>
</div>
</div>
