2015-12-30-generic-functions-and-multimethods-versus-visitors-and-factories.org
* Common Lisp

Here is the same problem solved in Common Lisp with generic functions and
multimethods.  I'll try to separate the classes, operations and their extensions
into files roughly as in the Java example above, although one would perhaps do
this differently in a real Lisp project.

First, the class hierarchy:

#+BEGIN_SRC lisp
  (in-package shape)

  (defclass shape () ())
#+END_SRC

#+BEGIN_SRC lisp
  (in-package shape)

  (defclass square (shape)
    ((width :initarg :width
            :reader square-width)))
#+END_SRC

#+BEGIN_SRC lisp
  (in-package shape)

  (defclass circle (shape)
    ((radius :initarg :radius
             :reader circle-radius)))
#+END_SRC

#+BEGIN_SRC lisp
  (in-package shape)

  (defclass translated (shape)
    ((shape :initarg :shape
            :reader translated-shape)
     (translation :initarg :translation
                  :reader translated-translation)))
#+END_SRC

The point helper:

#+BEGIN_SRC lisp
  (in-package shape)

  (defclass point ()
    ((x :initarg :x
        :reader point-x)
     (y :initarg :y
        :reader point-y)))
#+END_SRC

The first operation:

#+BEGIN_SRC lisp
  (in-package shape)

  (defgeneric point-in-p (point shape)
    (:documentation "Returns whether the POINT lies within SHAPE."))

  (defmethod point-in-p ((point point) (square square))
    (and (< (- (/ (square-width square) 2))
            (point-x point)
            (/ (square-width square) 2))
         (< (- (/ (square-width square) 2))
            (point-y point)
            (/ (square-width square) 2))))

  (defmethod point-in-p ((point point) (circle circle))
    (< (sqrt (+ (expt (point-x point) 2)
                (expt (point-y point) 2)))
       (circle-radius circle)))

  (defmethod point-in-p ((point point) (translated translated))
    (point-in-p (make-instance point
                               :x (- (point-x point)
                                     (point-x (translated-translation translated)))
                               :y (- (point-y point)
                                     (point-y (translated-translation translated))))
                (translated-shape translated)))
#+END_SRC

Adding an operation:

#+BEGIN_SRC lisp
  (in-package shape)

  (defgeneric shrink (shape factor)
    (:documentation "Returns a copy of SHAPE shrunk by FACTOR."))

  (defmethod shrink :before ((shape t) factor)
    (check-type factor (real (0) *)
                "a positive real number"))

  (defmethod shrink ((square square) (factor real))
    (make-instance 'square
                   :width (/ (square-width square) factor)))

  (defmethod shrink ((circle circle) (factor real))
    (make-instance 'circle
                   :radius (/ (circle-radius circle) factor)))

  (defmethod shrink ((translated translated) (factor real))
    (make-instance 'translated
                   :shape (shrink (translated-shape translated) factor)
                   :translation (translated-translation translated)))
#+END_SRC

Adding a new class:

#+BEGIN_SRC lisp
  (in-package shape)

  (defclass union (shape)
    ((shape0 :initarg :shape0
             :reader union-shape0)
     (shape1 :initarg :shape1
             :reader union-shape1)))
#+END_SRC

Adding the operations:

#+BEGIN_SRC lisp
  (in-package shape)

  (defmethod point-in-p ((point point) (union union))
    (or (point-in-p point (union-shape0 union))
        (point-in-p point (union-shape1 union))))
#+END_SRC

#+BEGIN_SRC lisp
  (in-package shape)

  (defmethod shrink ((union union) (factor real))
    (make-instance 'union
                   :shape0 (shrink (union-shape0 union) factor)
                   :shape1 (shrink (union-shape1 union) factor)))
#+END_SRC

* Your thoughts

Please, take a moment to compare what you have seen.  Maybe translate it to a
language or syntax that you are more familiar with (Java is not for everyone).

I shall continue after the break.

* Comparison

OK, break is over.

The primary goal of the article I mentioned in the introduction was to design
the code in such a way that a user can extend it without modifying or replacing
existing code.  In a real-world sense, the basic shape definition, the square,
circle, and translated shape, as well as the point-in operation might be part of
a library, while the union shape and the shrink operation are parts of code that
is using that library.

This means that the Java library needs to be designed with such extensibility
explicitly in mind.  Going through the motions of having the factory method in
the visitor contract would otherwise not be obvious or worthwhile.  The Common
Lisp library, on the other hand, would just be written the way shown, even if
its author never thought about a user wanting to add shapes or operations.

What if you want to further extend this functionality, for example: with an
ellipse shape?  In the Java case, you can't just add ~Ellipse~,
~EllipseShapeVisitor<T>~, ~PointInEllipse~, and ~ShrinkEllipse~, because then
you'd need to decide whether to use a ~ShrinkEllipse~ or a ~ShrinkUnion~
whenever you wish to shrink a Shape that you can only determine at runtime
(e. g. iterating over a Collection<Shape>).  Instead, you end up with a
MyProjectShapeShrinker that knows all your extensions.  If someone on your
project overlooks the fact that someone else already (or in parallel) had added
a ShrinkUnion visitor and adds the ShrinkEllipse visitor himself, you have a
bug, where one part of the code understands one subset of shapes and a different
part another.  Not only does this compile without warning, it also likely tests
OK, since the tests added for each addition by itself would ignore the other
just the same.

With generic functions (the Common Lisp case), you just add the methods, and it
works.  Programmer A adds a union shape, programmer B adds the ellipse shape,
the code is merged, all functions continue to work .

Another example: programmer A adds the union shape, but programmer B adds the
shrink operation.

In Java, A adds ~Union~, ~UnionShapeVisitor<T>~, and ~PointInUnion~, while B
adds ~Shrink~ (which implements ~ShapeVisitor<T>~, so is missing a method for
~Union~).  Again, this compiles fine and will likely test OK when the
programmers are not aware of each other's development.  Some time later, you get
a ClassCastException or an IllegalArgumentException, depending on how the
visitors are implemented.

This problem is about the same in Common Lisp, though: A adds ~union~, B adds
~shrink~, but the method that shrinks unions is missing.  Some time later, you
get an error that there is no applicable method for ~shrink~ when given a
~union~.

The difference is the effort needed to correct the mistake: in Common Lisp, you
add the missing method(s).  In Java, you need to make ~Shrink~ implement
~UnionShapeVisitor<T>~ instead of ~ShapeVisitor<T>~, then add the method to this
file.  It gets more involved when multiple shapes were added independently: you
need to merge the different interfaces extending ~ShapeVisitor<T>~ as well as
all their implementations and make all their call sites use the respective
merged visitor.

