2015-12-30-generic-functions-and-multimethods-versus-visitors-and-factories.html

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Common Lisp</h2>
<div class="outline-text-2" id="text-3">
<p>
Here is the same problem solved in Common Lisp with generic functions and
multimethods.  I'll try to separate the classes, operations and their extensions
into files roughly as in the Java example above, although one would perhaps do
this differently in a real Lisp project.
</p>

<p>
First, the class hierarchy:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(in-package shape)

(defclass shape () ())
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp">(in-package shape)

(defclass square (shape)
  ((width :initarg :width
          :reader square-width)))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp">(in-package shape)

(defclass circle (shape)
  ((radius :initarg :radius
           :reader circle-radius)))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp">(in-package shape)

(defclass translated (shape)
  ((shape :initarg :shape
          :reader translated-shape)
   (translation :initarg :translation
                :reader translated-translation)))
</pre>
</div>

<p>
The point helper:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(in-package shape)

(defclass point ()
  ((x :initarg :x
      :reader point-x)
   (y :initarg :y
      :reader point-y)))
</pre>
</div>

<p>
The first operation:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(in-package shape)

(defgeneric point-in-p (point shape)
  (:documentation "Returns whether the POINT lies within SHAPE."))

(defmethod point-in-p ((point point) (square square))
  (and (&lt; (- (/ (square-width square) 2))
          (point-x point)
          (/ (square-width square) 2))
       (&lt; (- (/ (square-width square) 2))
          (point-y point)
          (/ (square-width square) 2))))

(defmethod point-in-p ((point point) (circle circle))
  (&lt; (sqrt (+ (expt (point-x point) 2)
              (expt (point-y point) 2)))
     (circle-radius circle)))

(defmethod point-in-p ((point point) (translated translated))
  (point-in-p (make-instance point
                             :x (- (point-x point)
                                   (point-x (translated-translation translated)))
                             :y (- (point-y point)
                                   (point-y (translated-translation translated))))
              (translated-shape translated)))
</pre>
</div>

<p>
Adding an operation:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(in-package shape)

(defgeneric shrink (shape factor)
  (:documentation "Returns a copy of SHAPE shrunk by FACTOR."))

(defmethod shrink :before ((shape t) factor)
  (check-type factor (real (0) *)
              "a positive real number"))

(defmethod shrink ((square square) (factor real))
  (make-instance 'square
                 :width (/ (square-width square) factor)))

(defmethod shrink ((circle circle) (factor real))
  (make-instance 'circle
                 :radius (/ (circle-radius circle) factor)))

(defmethod shrink ((translated translated) (factor real))
  (make-instance 'translated
                 :shape (shrink (translated-shape translated) factor)
                 :translation (translated-translation translated)))
</pre>
</div>

<p>
Adding a new class:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(in-package shape)

(defclass union (shape)
  ((shape0 :initarg :shape0
           :reader union-shape0)
   (shape1 :initarg :shape1
           :reader union-shape1)))
</pre>
</div>

<p>
Adding the operations:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(in-package shape)

(defmethod point-in-p ((point point) (union union))
  (or (point-in-p point (union-shape0 union))
      (point-in-p point (union-shape1 union))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp">(in-package shape)

(defmethod shrink ((union union) (factor real))
  (make-instance 'union
                 :shape0 (shrink (union-shape0 union) factor)
                 :shape1 (shrink (union-shape1 union) factor)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Your thoughts</h2>
<div class="outline-text-2" id="text-4">
<p>
Please, take a moment to compare what you have seen.  Maybe translate it to a
language or syntax that you are more familiar with (Java is not for everyone).
</p>

<p>
I shall continue after the break.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Comparison</h2>
<div class="outline-text-2" id="text-5">
<p>
OK, break is over.
</p>

<p>
The primary goal of the article I mentioned in the introduction was to design
the code in such a way that a user can extend it without modifying or replacing
existing code.  In a real-world sense, the basic shape definition, the square,
circle, and translated shape, as well as the point-in operation might be part of
a library, while the union shape and the shrink operation are parts of code that
is using that library.
</p>

<p>
This means that the Java library needs to be designed with such extensibility
explicitly in mind.  Going through the motions of having the factory method in
the visitor contract would otherwise not be obvious or worthwhile.  The Common
Lisp library, on the other hand, would just be written the way shown, even if
its author never thought about a user wanting to add shapes or operations.
</p>

<p>
What if you want to further extend this functionality, for example: with an
ellipse shape?  In the Java case, you can't just add <code>Ellipse</code>,
<code>EllipseShapeVisitor&lt;T&gt;</code>, <code>PointInEllipse</code>, and <code>ShrinkEllipse</code>, because then
you'd need to decide whether to use a <code>ShrinkEllipse</code> or a <code>ShrinkUnion</code>
whenever you wish to shrink a Shape that you can only determine at runtime
(e. g. iterating over a Collection&lt;Shape&gt;).  Instead, you end up with a
MyProjectShapeShrinker that knows all your extensions.  If someone on your
project overlooks the fact that someone else already (or in parallel) had added
a ShrinkUnion visitor and adds the ShrinkEllipse visitor himself, you have a
bug, where one part of the code understands one subset of shapes and a different
part another.  Not only does this compile without warning, it also likely tests
OK, since the tests added for each addition by itself would ignore the other
just the same.
</p>

<p>
With generic functions (the Common Lisp case), you just add the methods, and it
works.  Programmer A adds a union shape, programmer B adds the ellipse shape,
the code is merged, all functions continue to work .
</p>

<p>
Another example: programmer A adds the union shape, but programmer B adds the
shrink operation.
</p>

<p>
In Java, A adds <code>Union</code>, <code>UnionShapeVisitor&lt;T&gt;</code>, and <code>PointInUnion</code>, while B
adds <code>Shrink</code> (which implements <code>ShapeVisitor&lt;T&gt;</code>, so is missing a method for
<code>Union</code>).  Again, this compiles fine and will likely test OK when the
programmers are not aware of each other's development.  Some time later, you get
a ClassCastException or an IllegalArgumentException, depending on how the
visitors are implemented.
</p>

<p>
This problem is about the same in Common Lisp, though: A adds <code>union</code>, B adds
<code>shrink</code>, but the method that shrinks unions is missing.  Some time later, you
get an error that there is no applicable method for <code>shrink</code> when given a
<code>union</code>.
</p>

<p>
The difference is the effort needed to correct the mistake: in Common Lisp, you
add the missing method(s).  In Java, you need to make <code>Shrink</code> implement
<code>UnionShapeVisitor&lt;T&gt;</code> instead of <code>ShapeVisitor&lt;T&gt;</code>, then add the method to this
file.  It gets more involved when multiple shapes were added independently: you
need to merge the different interfaces extending <code>ShapeVisitor&lt;T&gt;</code> as well as
all their implementations and make all their call sites use the respective
merged visitor.
</p>
</div>
</div>
